
### :x: Terraform Format and Style 🎨
<details><summary>Logs</summary>
Output
```diff
test-format.tf
--- old/test-format.tf
+++ new/test-format.tf
@@ -1,30 +1,30 @@
 resource "aws_dynamodb_table" "basic-dynamodb-table" {
-  name = "GameScore"
-  billing_mode      = "PROVISIONED"
-  read_capacity    = 120
-  write_capacity    = 10
-  hash_key            = "UserId"
-  range_key  = "GameTitle"
+  name           = "GameScore"
+  billing_mode   = "PROVISIONED"
+  read_capacity  = 120
+  write_capacity = 10
+  hash_key       = "UserId"
+  range_key      = "GameTitle"
 
 
   attribute {
-    name    = "UserId"
-    type =                    "S"
+    name = "UserId"
+    type = "S"
   }
 
-  attribute         {  
-    name         = "GameTitle"
-    type     = "S"
+  attribute {
+    name = "GameTitle"
+    type = "S"
   }
 
   attribute {
-    name   = "TopScore"
-    type              = "N"
+    name = "TopScore"
+    type = "N"
   }
 
   ttl {
-    attribute_name     = "TimeToExist"
-    enabled  = false
+    attribute_name = "TimeToExist"
+    enabled        = false
   }
 
   global_secondary_index {
@@ -43,7 +43,7 @@
   }
 
   tags = {
-    Name        =           "dynamodb-table-1"
-    Environment   = "production"
+    Name        = "dynamodb-table-1"
+    Environment = "production"
   }
 }

```
Errors
```

```
</details> <!-- End Format Logs -->
### :heavy_check_mark: Terraform Initialization ⚙️
<details><summary>Logs</summary>
Output
```

[0m[1mInitializing the backend...[0m
[0m[32m
Successfully configured the backend "remote"! Terraform will automatically
use this backend unless the backend configuration changes.[0m

[0m[1mInitializing provider plugins...[0m
- Finding latest version of hashicorp/random...
- Finding latest version of hashicorp/aws...
- Installing hashicorp/random v3.1.0...
- Installed hashicorp/random v3.1.0 (self-signed, key ID [0m[1m34365D9472D7468F[0m[0m)
- Installing hashicorp/aws v3.42.0...
- Installed hashicorp/aws v3.42.0 (self-signed, key ID [0m[1m34365D9472D7468F[0m[0m)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has created a lock file [1m.terraform.lock.hcl[0m to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.[0m

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m

```
Errors
```

```
</details> <!-- End Init Logs -->
### :heavy_check_mark: Terraform Validation 🤖
<details><summary>Logs</summary>
Output
```
Success! The configuration is valid.


```
Errors
```

```
</details> <!-- End Validate Logs -->
### :heavy_check_mark: Terraform Plan 📖
<details><summary>Logs</summary>
```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/brambles/gh-actions-demo/runs/run-AtZ1CHUqvHCra92P

Waiting for the plan to start...

Terraform v0.14.9
Configuring remote state backend...
Initializing Terraform configuration...
module.key_pair.aws_key_pair.key: Refreshing state... [id=key]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_dynamodb_table.basic-dynamodb-table will be created
  + resource "aws_dynamodb_table" "basic-dynamodb-table" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "UserId"
      + id               = (known after apply)
      + name             = "GameScore"
      + range_key        = "GameTitle"
      + read_capacity    = 120
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "production"
          + "Name"        = "dynamodb-table-1"
        }
      + tags_all         = {
          + "Environment" = "production"
          + "Name"        = "dynamodb-table-1"
        }
      + write_capacity   = 10

      + attribute {
          + name = "GameTitle"
          + type = "S"
        }
      + attribute {
          + name = "TopScore"
          + type = "N"
        }
      + attribute {
          + name = "UserId"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "GameTitle"
          + name               = "GameTitleIndex"
          + non_key_attributes = [
              + "UserId",
            ]
          + projection_type    = "INCLUDE"
          + range_key          = "TopScore"
          + read_capacity      = 10
          + write_capacity     = 10
        }

      + point_in_time_recovery {
          + enabled = (known after apply)
        }

      + server_side_encryption {
          + enabled     = (known after apply)
          + kms_key_arn = (known after apply)
        }

      + ttl {
          + attribute_name = "TimeToExist"
          + enabled        = false
          + kms_key_arn    = (known after apply)
        }
    }

  # aws_key_pair.key will be created
  + resource "aws_key_pair" "key" {
      + arn         = (known after apply)
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + key_name    = "key"
      + key_pair_id = (known after apply)
      + public_key  = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQD3F6tyPEFEzV0LX3X8BsXdMsQz1x2cEikKDEY0aIj41qgxMCP/iteneqXSIFZBp5vizPvaoIR3Um9xK7PGoW8giupGn+EPuxIA4cDM4vzOqOkiMPhz5XK0whEjkVzTo4+S0puvDZuwIsdiW9mxhJc7tgBNL0cYlWSYVkz4G/fslNfRPW5mYAM49f4fhtxPb5ok4Q2Lg9dPKVHO/Bgeu5woMc7RY0p1ej6D4CKFE6lymSDJpW0YHX/wqE9+cfEauh7xZcG0q9t2ta6F6fmX0agvpFyZo8aFbXeUBr7osSCJNgvavWbM/06niWrOvYX2xwWdhXmXSrbX8ZbabVohBK41 email@example.com"
      + tags_all    = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

```
</details>
*Pusher: @rajvasupilli, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*